console.log("Privet mir!");
    //энто коментарий ни на что не влияющий
    /*
        энто большой многострочный коментарий так удобней и заметней
    */

    /*
        Типы данных в JavaScript
            В ES5 имеется 6 типов данных
                5 простых (тривиальных)
                1 сложный (составной)
    */
   
    /*
         Number - числовой тип данных (любое число)
             6.4 да
             6,4 нит (запятая блиннн)
             
         Операторы для чисел
             + оператор сложения
             - оператор вычитания
             * оператор умножения
             / оператор деления
             % остаток от деления 4%3 => 1
             ** возведение в степень (2**3 = 8)
    */

    // Есть 8 студентов 
    // Есть 15 яблок
    // Сколько целых яблок можно отдать студентам

   let students = 8 
   let apples = 15
   // students, apples;
   //ctrl+/